In [1]:
import pandas as pd

# handling missing value
isnull() - true if data is missing | false means data is present
isnull().sum() - count of missing values in columns

In [4]:
data = {
    "name": ["pritish","vasu","ram","shyam","aman"],
    "age" : [24,25,22,23,None],
    "salary":[200000,400000,None,60000,40000]
}
df=pd.DataFrame(data)

In [5]:
df.isnull()

    name    age  salary
0  False  False   False
1  False  False   False
2  False  False    True
3  False  False   False
4  False   True   False

In [6]:
df.isnull().sum()

name      0
age       1
salary    1
dtype: int64

# Droping missing row or column
dropna(axis=" ", inplace="")

In [8]:
drop_view =df.dropna(axis=0,inplace=False)
print(df)
print(drop_view)

      name   age    salary
0  pritish  24.0  200000.0
1     vasu  25.0  400000.0
2      ram  22.0       NaN
3    shyam  23.0   60000.0
4     aman   NaN   40000.0
      name   age    salary
0  pritish  24.0  200000.0
1     vasu  25.0  400000.0
3    shyam  23.0   60000.0

In [ ]:
## to fill null spaces we use FILLNA()

df["age"].fillna(df["age"].mean(),inplace=True)
df["salary"].fillna(df["salary"].mean(),inplace=True)
df

C:\Users\PRITISH TIWARI\AppData\Local\Temp\ipykernel_11956\2931802352.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["salary"].fillna(df["salary"].mean(),inplace=True)

      name   age    salary
0  pritish  24.0  200000.0
1     vasu  25.0  400000.0
2      ram  22.0  175000.0
3    shyam  23.0   60000.0
4     aman  23.5   40000.0

# interpolate method
fills null value on the basis of other data points around it
df.interpolate(method="",axis="",inplace="true")

In [12]:
data = {
    "name": ["pritish","vasu","ram","shyam","aman"],
    "age" : [24,25,22,23,None],
    "salary":[200000,400000,None,60000,40000]
}
df=pd.DataFrame(data)

In [13]:
df.isnull()

    name    age  salary
0  False  False   False
1  False  False   False
2  False  False    True
3  False  False   False
4  False   True   False

In [15]:
df.interpolate(method="linear",axis=0,inplace=True)
df

C:\Users\PRITISH TIWARI\AppData\Local\Temp\ipykernel_11956\4024095860.py:1: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  df.interpolate(method="linear",axis=0,inplace=True)

      name   age    salary
0  pritish  24.0  200000.0
1     vasu  25.0  400000.0
2      ram  22.0  230000.0
3    shyam  23.0   60000.0
4     aman  23.0   40000.0

# sorting
df.sort_values(by="",ascending/descending=true/false,inplace="")  true for ASC False for DESC

In [17]:
df.sort_values(by="age",ascending=False,inplace=True)
df

      name   age    salary
1     vasu  25.0  400000.0
0  pritish  24.0  200000.0
4     aman  23.0   40000.0
3    shyam  23.0   60000.0
2      ram  22.0  230000.0

In [18]:
df.sort_values(by=["age","salary"],ascending=[True,False],inplace=True)
df

      name   age    salary
2      ram  22.0  230000.0
3    shyam  23.0   60000.0
4     aman  23.0   40000.0
0  pritish  24.0  200000.0
1     vasu  25.0  400000.0

# Group by Method

In [20]:
group_by=df.groupby("age")["salary"].sum()
print(group_by)

age
22.0    230000.0
23.0    100000.0
24.0    200000.0
25.0    400000.0
Name: salary, dtype: float64

In [22]:
group_by_2=df.groupby(["age","name"])["salary"].sum()
print(group_by_2)

age   name
22.0  ram        230000.0
23.0  aman        40000.0
      shyam       60000.0
24.0  pritish    200000.0
25.0  vasu       400000.0
Name: salary, dtype: float64

# Merge and join
pd.merge(df1,df2,on="column name",how="type of join")

In [25]:
df1={
    "emp_id":[1,2,3],
    "name" : ["ram","shyam","aman"]
}
df2={
    "emp_id" : [1,2,4],
    "salary" : [2000,4000,5000]
}
df1=pd.DataFrame(df1)
df2=pd.DataFrame(df2)

# inner join | 
only gives common data present in both side

In [26]:
merged = pd.merge(df1,df2,on="emp_id",how="inner")
print("inner join")
print(merged)

inner join
   emp_id   name  salary
0       1    ram    2000
1       2  shyam    4000

# outer join
gives all data and fills missing values with NaN

In [27]:
merged = pd.merge(df1,df2,on="emp_id",how="outer")
print("outer join")
print(merged)

outer join
   emp_id   name  salary
0       1    ram  2000.0
1       2  shyam  4000.0
2       3   aman     NaN
3       4    NaN  5000.0

 # left join
 gives only left side value

In [28]:
merged = pd.merge(df1,df2,on="emp_id",how="left")
print("left join")
print(merged)

left join
   emp_id   name  salary
0       1    ram  2000.0
1       2  shyam  4000.0
2       3   aman     NaN

# right join
gives only right side value

In [30]:
merged = pd.merge(df1,df2,on="emp_id",how="right")
print("right join")
print(merged)

right join
   emp_id   name  salary
0       1    ram    2000
1       2  shyam    4000
2       4    NaN    5000

# concatenate
pd.concat([df1,df2],axis="",ignoew_index="")

In [31]:
df1={
    "emp_id":[1,2,3],
    "name" : ["ram","shyam","aman"]
}
df2={
    "emp_id" : [4,5,6],
    "name": ["seedhe","maut","KR$NA"]
}
df1=pd.DataFrame(df1)
df2=pd.DataFrame(df2)

In [32]:
concat=pd.concat([df1,df2],axis=0,ignore_index=True)
print(concat)

   emp_id    name
0       1     ram
1       2   shyam
2       3    aman
3       4  seedhe
4       5    maut
5       6   KR$NA

In [33]:
concat=pd.concat([df1,df2],axis=1,ignore_index=True)
print(concat)

   0      1  2       3
0  1    ram  4  seedhe
1  2  shyam  5    maut
2  3   aman  6   KR$NA